In [2]:
# 전날 종가가 상승했을 때 종가와 다음날 사이 수익률 비교
import pandas as pd
from antQuant.utils import DataManager

In [3]:
stock = DataManager()

In [4]:
data = stock.read_data('AH_DB', 'adjdailyohlcv',['date', 'code', 'close', 'open'], conditions = {'date': "BETWEEN DATE ' 2016-01-01' AND DATE '2018-05-01'"})

In [5]:
data.date = pd.to_datetime(data.date)
data.head()

        date    code     close      open
0 2016-01-04  001040  244000.0  247500.0
1 2016-01-04  001045  123500.0  128000.0
2 2016-01-04  001210   12791.4   12890.6
3 2016-01-04  001420    3825.0    3800.0
4 2016-01-04  001689   32050.0   32050.0

In [8]:
data.set_index(['date', 'code'], inplace=True)
data.head()

                      close      open
date       code
2016-01-04 001040  244000.0  247500.0
           001045  123500.0  128000.0
           001210   12791.4   12890.6
           001420    3825.0    3800.0
           001689   32050.0   32050.0

In [9]:
import numpy as np

In [10]:
# 다음날 시가를 당일 종가로 맞추기
data['opend1'] = data['open'].groupby(level=1).shift(-1)
data.head()

                      close      open    opend1
date       code
2016-01-04 001040  244000.0  247500.0  241500.0
           001045  123500.0  128000.0  124500.0
           001210   12791.4   12890.6   12494.0
           001420    3825.0    3800.0    3705.0
           001689   32050.0   32050.0   31650.0

In [11]:
data['returns'] = np.log(data['opend1']/data['close'])
data = data[(data['returns']!=np.inf)&(data['returns']!=-np.inf)]
data.head()

//anaconda/lib/python3.5/site-packages/ipykernel/__main__.py:1: RuntimeWarning: divide by zero encountered in log
  if __name__ == '__main__':

                      close      open    opend1   returns
date       code
2016-01-04 001040  244000.0  247500.0  241500.0 -0.010299
           001045  123500.0  128000.0  124500.0  0.008065
           001210   12791.4   12890.6   12494.0 -0.023525
           001420    3825.0    3800.0    3705.0 -0.031875
           001689   32050.0   32050.0   31650.0 -0.012559

In [19]:
data['diff'] = data['close'] - data['open']
data['returns'].dropna()
data.head()

                      close      open    opend1   returns    diff
date       code
2016-01-04 001040  244000.0  247500.0  241500.0 -0.010299 -3500.0
           001045  123500.0  128000.0  124500.0  0.008065 -4500.0
           001210   12791.4   12890.6   12494.0 -0.023525   -99.2
           001420    3825.0    3800.0    3705.0 -0.031875    25.0
           001689   32050.0   32050.0   31650.0 -0.012559     0.0

In [33]:
# 전날 종가가 상승했을 때 리턴값
data[data['diff'] > 0]['returns'].dropna()
print('sum of returns: {0}'.format(data[data['diff'] > 0]['returns'].dropna().sum()))
print(data[data['diff'] > 0]['returns'].dropna().describe())

sum of returns: 448.97102985158057
count    589796.000000
mean          0.000761
std           0.023911
min          -2.353969
25%          -0.003401
50%           0.000000
75%           0.005676
max           4.598801
Name: returns, dtype: float64

In [34]:
# 전날 종가가 상승했을 때 리턴값
data[data['diff'] < 0]['returns'].dropna()
print('sum of returns: {0}'.format(data[data['diff'] < 0]['returns'].dropna().sum()))
print(data[data['diff'] < 0]['returns'].dropna().describe())

sum of returns: 765.6067090951924
count    673111.000000
mean          0.001137
std           0.018376
min          -1.473482
25%          -0.003454
50%           0.000000
75%           0.005489
max           0.867501
Name: returns, dtype: float64